(function(){
	miData = {
		
		starGoods : {
			borderColor : ['#ffcccc','#33ff00','#0033ff','#cc0033','#ffff00','#ccff00','#ff0000','#66ff00','#ff99ff','#0000ff'],
			imgSrc : ['img/starGoods/1.jpg','img/starGoods/2.jpg','img/starGoods/3.jpg','img/starGoods/4.jpg','img/starGoods/5.jpg','img/starGoods/6.jpg','img/starGoods/7.jpg','img/starGoods/8.jpg','img/starGoods/9.jpg','img/starGoods/10.jpg'],
			imgAlt : [],
			title : ['小型猫爬架' , '鸡毛逗猫棒' , '老鼠（5只装） 猫玩具', '羽毛花朵钢丝杆逗猫棒' , '乳胶发声狗玩具','乳胶狗骨头','橡胶弹球狗玩具 ' ,'狗咬绳编织玩具' ,'自动喂食喂水器' ,'猫咪食具水碗'],
			detail : ['怡亲多可特小型猫爬架 D-001' , '田田猫 弹簧钢丝天然鸡毛' , '田田猫 兔皮老鼠（5只装）' , '经典羽毛花朵钢丝杆逗猫棒' , '伊丽Elite' , '伊丽Elite','petmate','千羽Soleil 宠物洁齿双结棉绳','爱丽思IRIS','伊丽Elite 陶瓷碗浅口'],
			price : ['199元' , '12元' ,'14元' ,'3.9元','69元','29元','99元','8.9元','9.9元','69元']
		},

		match:{
			hot:{
				title : ['除菌消臭清新喷雾300ml' , '小型犬狗窝','小型犬衣服泰迪比熊衣服' ,'除臭结团猫砂','猫用麦芽毛球营养膏','宠物加水围边水床','托运笼 托运箱','防冲胸背带'],
				price : ['48元','119元','87元','25.9元','19.9元','128元','118元','69元'],
				comment : ['1.9万','2.8万','8.7万','11.6万','4356','908','2万','10.1万']
			},
			earphone:{
				title : ['自动喂食喂水器' , '猫狗食盆饭碗扁','壁挂式宠物弹珠饮水壶' ,'宠物活氧饮水机专用滤芯棉','猫狗用眼睛湿巾100片','宠物储粮桶5kg','宠物清洁器拾便器','怡亲 宠物拾便器'],
				price : ['79元','69元','99元','29元','9.9元','12.9元','6.9元','11.8元'],
				comment : ['19.1万','15.2万','19.1万','15.2万','6666','5000','5万','1万']
			},
			card:{
				title : ['法国皇家ROYAL  猫粮' , '伟嘉 成猫精选金枪鱼味妙鲜包85g','金枪鱼+丁香鱼味猫罐头170g' ,'路斯 三文鱼肉丁35g','杂锦罐装磨牙防口臭饼干1kg','成犬牛肉拌狗粮妙鲜包100g','麦富迪 犬用鸡胸肉400g','仿真培根牛肉磨牙棒75g'],
				price : ['38.9元','53.2','19.9元','29元','78.9元','65.5元','69元','26.9元'],
				comment : ['23万','4.2万','1.8万','2.9万','3426','6700','4万','8万']
			},
			power:{
				title : ['怡亲多可特 小型猫爬架 D-001' , '小弹簧钢丝天然鸡毛逗猫棒','兔皮老鼠（5只装' ,'经典羽毛花朵钢丝杆逗猫棒','乳胶发声狗玩具 中小型犬','乳胶发声狗玩具 大型犬','超级橡胶弹球狗玩具 两只装','Soleil 宠物洁齿双结棉绳'],
				price : ['199元','12元','14元','3.9元','69元','29元','99元','8.9元'],
				comment : ['19.1万','15.2万','19.1万','15.2万','6666','5000','5万','1万']
			},
			length : 4,
			attr : ['hot' , 'earphone' , 'card' , 'power']
		}


		
	};
	window.miDate = miData;
})();